app/controllers/todo_lists_controller.rb

SELECT "todo_lists".* FROM "todo_lists"
---
  def index
    @todo_lists = TodoList.all

INSERT INTO "todo_lists" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "wednesday"], ["description", "3"], ["created_at", "2019-07-03 19:20:38.229738"], ["updated_at", "2019-07-03 19:20:38.229738"]]
---
  def create
    @todo_list = TodoList.new(todo_list_params)

    respond_to do |format|
      if @todo_list.save

UPDATE "todo_lists" SET "description" = ?, "updated_at" = ? WHERE "todo_lists"."id" = ?  [["description", "ss"], ["updated_at", "2019-07-09 11:01:07.108202"], ["id", 9]]
---
  def update
    respond_to do |format|
      if @todo_list.update(todo_list_params)